In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.__version__

'0.24.2'

# DataStructure - Series

### convert a list, numpy array, or dictionary to a Series:

In [3]:
labels= ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10 , 'b':20 , 'c':30 }

## Creating a Series - Using Lists

In [4]:
pd.Series(data = my_list )

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data = my_list , index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series( my_list , labels)

a    10
b    20
c    30
dtype: int64

## Creating a Series - NumPy Arrays

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [8]:
pd.Series(data = arr , index = labels)

a    10
b    20
c    30
dtype: int32

In [9]:
pd.Series( arr , labels)

a    10
b    20
c    30
dtype: int32

## Creating a Series - Dictionary

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

# Operations based off of index

In [11]:
my_series1 = pd.Series([1,2,3,4,5],index=['usa','italy','iran','japan','china'])
my_series1

usa      1
italy    2
iran     3
japan    4
china    5
dtype: int64

In [12]:
my_series2 = pd.Series([1,6,8,9,2],index=['usa','italy','australia','china','iran'])
my_series2

usa          1
italy        6
australia    8
china        9
iran         2
dtype: int64

In [13]:
my_series1 + my_series2

australia     NaN
china        14.0
iran          5.0
italy         8.0
japan         NaN
usa           2.0
dtype: float64

# Show index and value

In [14]:
my_series = pd.Series([1, 2, 3,4,5],index=['row1','row2','row3','row4','row5'])
my_series

row1    1
row2    2
row3    3
row4    4
row5    5
dtype: int64

In [15]:
my_series.index

Index(['row1', 'row2', 'row3', 'row4', 'row5'], dtype='object')

In [16]:
my_series.values

array([1, 2, 3, 4, 5], dtype=int64)

## Select index

In [17]:
my_series.row2

2

In [18]:
my_series["row2"]

2

## Condition in Series

In [19]:
my_series[my_series>3]

row4    4
row5    5
dtype: int64

# DataStructure - DataFrame

## Create DataFrame with Array

In [20]:
import numpy as np
my_array = np.array([[1 ,5 ,9 ,13],[2 ,6 ,10 ,14],[3 ,7 ,11 ,15],[4 ,8 ,12 ,16]])
my_df = pd.DataFrame(my_array,index=['row1' ,'row2' ,'row3' ,'row4'],columns=['col1' ,'col2' ,'col3' ,'col4'])
my_df

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

## Create DataFrame with Dictionary

In [21]:
my_dict = {'col1':[1,2,3,4],'col2':[5,6,7,8],'col3':[9,10,11,12],'col4':[13,14,15,19]}
my_df = pd.DataFrame(my_dict, index=['row1','row2','row3','row4'])
my_df

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    19

## Show index and column and value

In [22]:
my_df.index

Index(['row1', 'row2', 'row3', 'row4'], dtype='object')

In [23]:
my_df.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [24]:
my_df.values

array([[ 1,  5,  9, 13],
       [ 2,  6, 10, 14],
       [ 3,  7, 11, 15],
       [ 4,  8, 12, 19]], dtype=int64)

In [25]:
from numpy.random import randn
# np.random.randn(20)

In [26]:
df = pd.DataFrame(randn(5,4), index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  1.633388  0.117110  0.599098 -0.341271
B -0.474814 -0.041924 -0.856425 -1.192117
C  0.159564  0.518858  1.542132 -0.874083
D -1.214930  1.348658  0.931178 -0.513196
E  1.501272 -0.978893  0.377926  1.189900

In [27]:
df['W']

A    1.633388
B   -0.474814
C    0.159564
D   -1.214930
E    1.501272
Name: W, dtype: float64

In [28]:
df[['W','Z']]

          W         Z
A  1.633388 -0.341271
B -0.474814 -1.192117
C  0.159564 -0.874083
D -1.214930 -0.513196
E  1.501272  1.189900

In [29]:
df.W

A    1.633388
B   -0.474814
C    0.159564
D   -1.214930
E    1.501272
Name: W, dtype: float64

### DataFrame Columns are just Series

In [30]:
type(df["W"])

pandas.core.series.Series

In [31]:
type(df)

pandas.core.frame.DataFrame

# Creating a new column

In [32]:
df

          W         X         Y         Z
A  1.633388  0.117110  0.599098 -0.341271
B -0.474814 -0.041924 -0.856425 -1.192117
C  0.159564  0.518858  1.542132 -0.874083
D -1.214930  1.348658  0.931178 -0.513196
E  1.501272 -0.978893  0.377926  1.189900

In [33]:
df['new'] = df['W'] + df['Y']

In [34]:
df

          W         X         Y         Z       new
A  1.633388  0.117110  0.599098 -0.341271  2.232486
B -0.474814 -0.041924 -0.856425 -1.192117 -1.331239
C  0.159564  0.518858  1.542132 -0.874083  1.701696
D -1.214930  1.348658  0.931178 -0.513196 -0.283752
E  1.501272 -0.978893  0.377926  1.189900  1.879198

# Removing Columns

In [35]:
df.drop('new', axis=1)

          W         X         Y         Z
A  1.633388  0.117110  0.599098 -0.341271
B -0.474814 -0.041924 -0.856425 -1.192117
C  0.159564  0.518858  1.542132 -0.874083
D -1.214930  1.348658  0.931178 -0.513196
E  1.501272 -0.978893  0.377926  1.189900

In [36]:
df

          W         X         Y         Z       new
A  1.633388  0.117110  0.599098 -0.341271  2.232486
B -0.474814 -0.041924 -0.856425 -1.192117 -1.331239
C  0.159564  0.518858  1.542132 -0.874083  1.701696
D -1.214930  1.348658  0.931178 -0.513196 -0.283752
E  1.501272 -0.978893  0.377926  1.189900  1.879198

In [37]:
df.drop('new', axis=1, inplace=True)

In [38]:
df

          W         X         Y         Z
A  1.633388  0.117110  0.599098 -0.341271
B -0.474814 -0.041924 -0.856425 -1.192117
C  0.159564  0.518858  1.542132 -0.874083
D -1.214930  1.348658  0.931178 -0.513196
E  1.501272 -0.978893  0.377926  1.189900

# Drop rows

In [39]:
df.drop('E', axis=0, inplace=True)

In [40]:
df

          W         X         Y         Z
A  1.633388  0.117110  0.599098 -0.341271
B -0.474814 -0.041924 -0.856425 -1.192117
C  0.159564  0.518858  1.542132 -0.874083
D -1.214930  1.348658  0.931178 -0.513196

# Selecting Rows

In [41]:
df

          W         X         Y         Z
A  1.633388  0.117110  0.599098 -0.341271
B -0.474814 -0.041924 -0.856425 -1.192117
C  0.159564  0.518858  1.542132 -0.874083
D -1.214930  1.348658  0.931178 -0.513196

In [42]:
df.loc['A']

W    1.633388
X    0.117110
Y    0.599098
Z   -0.341271
Name: A, dtype: float64

# Select based off of position

In [43]:
df

          W         X         Y         Z
A  1.633388  0.117110  0.599098 -0.341271
B -0.474814 -0.041924 -0.856425 -1.192117
C  0.159564  0.518858  1.542132 -0.874083
D -1.214930  1.348658  0.931178 -0.513196

In [44]:
df.iloc[2]

W    0.159564
X    0.518858
Y    1.542132
Z   -0.874083
Name: C, dtype: float64

# Selecting subset of rows and columns

In [45]:
df.loc['B','Y']

-0.8564253659541341

In [46]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  1.633388  0.599098
B -0.474814 -0.856425

# Conditional Selection

In [47]:
df

          W         X         Y         Z
A  1.633388  0.117110  0.599098 -0.341271
B -0.474814 -0.041924 -0.856425 -1.192117
C  0.159564  0.518858  1.542132 -0.874083
D -1.214930  1.348658  0.931178 -0.513196

In [48]:
df>0

       W      X      Y      Z
A   True   True   True  False
B  False  False  False  False
C   True   True   True  False
D  False   True   True  False

In [49]:
df[df>0]

          W         X         Y   Z
A  1.633388  0.117110  0.599098 NaN
B       NaN       NaN       NaN NaN
C  0.159564  0.518858  1.542132 NaN
D       NaN  1.348658  0.931178 NaN

In [50]:
df[df['W']>0]

          W         X         Y         Z
A  1.633388  0.117110  0.599098 -0.341271
C  0.159564  0.518858  1.542132 -0.874083

In [51]:
df[df['W']>0] ['Y']

A    0.599098
C    1.542132
Name: Y, dtype: float64

In [52]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.599098  0.117110
C  1.542132  0.518858

# For two conditions use | and &

In [53]:
df[(df['W']<0) & (df['Y']>0)]

         W         X         Y         Z
D -1.21493  1.348658  0.931178 -0.513196

In [54]:
df[(df['W']<0) | (df['Y']<0)]

          W         X         Y         Z
B -0.474814 -0.041924 -0.856425 -1.192117
D -1.214930  1.348658  0.931178 -0.513196

# Reset index

In [55]:
df

          W         X         Y         Z
A  1.633388  0.117110  0.599098 -0.341271
B -0.474814 -0.041924 -0.856425 -1.192117
C  0.159564  0.518858  1.542132 -0.874083
D -1.214930  1.348658  0.931178 -0.513196

In [56]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.633388  0.117110  0.599098 -0.341271
1     B -0.474814 -0.041924 -0.856425 -1.192117
2     C  0.159564  0.518858  1.542132 -0.874083
3     D -1.214930  1.348658  0.931178 -0.513196

# Set index

In [57]:
newind = 'CA NY WY OR'.split()
newind

['CA', 'NY', 'WY', 'OR']

In [58]:
df

          W         X         Y         Z
A  1.633388  0.117110  0.599098 -0.341271
B -0.474814 -0.041924 -0.856425 -1.192117
C  0.159564  0.518858  1.542132 -0.874083
D -1.214930  1.348658  0.931178 -0.513196

In [59]:
df['States'] = newind

In [60]:
df

          W         X         Y         Z States
A  1.633388  0.117110  0.599098 -0.341271     CA
B -0.474814 -0.041924 -0.856425 -1.192117     NY
C  0.159564  0.518858  1.542132 -0.874083     WY
D -1.214930  1.348658  0.931178 -0.513196     OR

In [61]:
df.set_index('States')

               W         X         Y         Z
States
CA      1.633388  0.117110  0.599098 -0.341271
NY     -0.474814 -0.041924 -0.856425 -1.192117
WY      0.159564  0.518858  1.542132 -0.874083
OR     -1.214930  1.348658  0.931178 -0.513196

In [62]:
df

          W         X         Y         Z States
A  1.633388  0.117110  0.599098 -0.341271     CA
B -0.474814 -0.041924 -0.856425 -1.192117     NY
C  0.159564  0.518858  1.542132 -0.874083     WY
D -1.214930  1.348658  0.931178 -0.513196     OR

In [63]:
df.set_index('States', inplace=True)

In [64]:
df

               W         X         Y         Z
States
CA      1.633388  0.117110  0.599098 -0.341271
NY     -0.474814 -0.041924 -0.856425 -1.192117
WY      0.159564  0.518858  1.542132 -0.874083
OR     -1.214930  1.348658  0.931178 -0.513196

## Edit a DataFrame

In [65]:
import numpy as np
import pandas as pd
my_array = np.array([[1 ,5 ,9 ,13],[2 ,6 ,10 ,14],[3 ,7 ,11 ,15],[4 ,8 ,12 ,16]])
my_df = pd.DataFrame(my_array,index=['row1' ,'row2' ,'row3' ,'row4'],columns=['col1' ,'col2' ,'col3' ,'col4'])
my_df

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [66]:
my_df['col5'] = [20 ,21 ,22 ,23]
my_df

      col1  col2  col3  col4  col5
row1     1     5     9    13    20
row2     2     6    10    14    21
row3     3     7    11    15    22
row4     4     8    12    16    23

In [67]:
my_df.loc[['row1','row2'],'col1'] = 0
my_df

      col1  col2  col3  col4  col5
row1     0     5     9    13    20
row2     0     6    10    14    21
row3     3     7    11    15    22
row4     4     8    12    16    23

# Deleting

In [68]:
my_df.drop('col5',axis=1)

      col1  col2  col3  col4
row1     0     5     9    13
row2     0     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [69]:
my_df.drop('row1',axis=0)

      col1  col2  col3  col4  col5
row2     0     6    10    14    21
row3     3     7    11    15    22
row4     4     8    12    16    23

# Renaming

In [70]:
my_df.rename(columns={'col4':'cooool4'})

      col1  col2  col3  cooool4  col5
row1     0     5     9       13    20
row2     0     6    10       14    21
row3     3     7    11       15    22
row4     4     8    12       16    23

In [71]:
my_df.rename(index={'row1':'row_one'})

         col1  col2  col3  col4  col5
row_one     0     5     9    13    20
row2        0     6    10    14    21
row3        3     7    11    15    22
row4        4     8    12    16    23

## Replace

In [72]:
my_df.replace({1:100})

      col1  col2  col3  col4  col5
row1     0     5     9    13    20
row2     0     6    10    14    21
row3     3     7    11    15    22
row4     4     8    12    16    23

# head and tail

In [73]:
df.head()

               W         X         Y         Z
States
CA      1.633388  0.117110  0.599098 -0.341271
NY     -0.474814 -0.041924 -0.856425 -1.192117
WY      0.159564  0.518858  1.542132 -0.874083
OR     -1.214930  1.348658  0.931178 -0.513196

In [74]:
df.tail()

               W         X         Y         Z
States
CA      1.633388  0.117110  0.599098 -0.341271
NY     -0.474814 -0.041924 -0.856425 -1.192117
WY      0.159564  0.518858  1.542132 -0.874083
OR     -1.214930  1.348658  0.931178 -0.513196

# Apply function on index

In [75]:
df

               W         X         Y         Z
States
CA      1.633388  0.117110  0.599098 -0.341271
NY     -0.474814 -0.041924 -0.856425 -1.192117
WY      0.159564  0.518858  1.542132 -0.874083
OR     -1.214930  1.348658  0.931178 -0.513196

In [76]:
df['W'] = df['W'].apply(lambda x:'{0:3.2f}'.format(x))
df

            W         X         Y         Z
States
CA       1.63  0.117110  0.599098 -0.341271
NY      -0.47 -0.041924 -0.856425 -1.192117
WY       0.16  0.518858  1.542132 -0.874083
OR      -1.21  1.348658  0.931178 -0.513196

# Sorting

## sorting index

In [77]:
my_df.sort_index(axis=1,ascending=False)

      col5  col4  col3  col2  col1
row1    20    13     9     5     0
row2    21    14    10     6     0
row3    22    15    11     7     3
row4    23    16    12     8     4

## sorting value

In [78]:
my_df.sort_values(by='col1',ascending=False)

      col1  col2  col3  col4  col5
row4     4     8    12    16    23
row3     3     7    11    15    22
row1     0     5     9    13    20
row2     0     6    10    14    21

# Missing Data

In [79]:
df = pd.DataFrame({ 'A':[1,2,np.nan],
                    'B':[5,np.nan,np.nan],
                    'C':[1,2,3]
                                })

In [80]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [81]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [82]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [83]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [84]:
df.fillna(value='fill value')

            A           B  C
0           1           5  1
1           2  fill value  2
2  fill value  fill value  3

In [85]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [86]:
import pandas as pd
data={  'Company': ['Google','Google','Microsoft','Microsoft','Facebook','Facebook'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sara'],
        'Sale' : [200,120,340,124,243,350]    
        }

In [87]:
df = pd.DataFrame(data)

In [88]:
df

     Company   Person  Sale
0     Google      Sam   200
1     Google  Charlie   120
2  Microsoft      Amy   340
3  Microsoft  Vanessa   124
4   Facebook     Carl   243
5   Facebook     Sara   350

In [89]:
by_company = df.groupby('Company')

In [90]:
by_company.mean()

            Sale
Company
Facebook   296.5
Google     160.0
Microsoft  232.0

In [91]:
by_company.max()

            Person  Sale
Company
Facebook      Sara   350
Google         Sam   200
Microsoft  Vanessa   340

In [92]:
by_company.min()

            Person  Sale
Company
Facebook      Carl   243
Google     Charlie   120
Microsoft      Amy   124

In [93]:
by_company.count()

           Person  Sale
Company
Facebook        2     2
Google          2     2
Microsoft       2     2

In [94]:
by_company.()

           Sale
          count   mean         std    min     25%    50%     75%    max
Company
Facebook    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [95]:
by_company.describe().transpose()

Company       Facebook      Google   Microsoft
Sale count    2.000000    2.000000    2.000000
     mean   296.500000  160.000000  232.000000
     std     75.660426   56.568542  152.735065
     min    243.000000  120.000000  124.000000
     25%    269.750000  140.000000  178.000000
     50%    296.500000  160.000000  232.000000
     75%    323.250000  180.000000  286.000000
     max    350.000000  200.000000  340.000000

# Create DataFrame

In [96]:
df = pd.DataFrame({'Col1':[1,2,3,4],'Col2':[4,5,6,4],'Col3':['a','b','c','d']})
df

   Col1  Col2 Col3
0     1     4    a
1     2     5    b
2     3     6    c
3     4     4    d

In [97]:
df['Col2'].unique()

array([4, 5, 6], dtype=int64)

In [98]:
df['Col2'].nunique()

3

In [99]:
df['Col2'].value_counts()

4    2
6    1
5    1
Name: Col2, dtype: int64

In [100]:
new_df = df [(df['Col1']>2) & (df['Col2']==4)]
new_df

   Col1  Col2 Col3
3     4     4    d

In [101]:
def time2(x):
    return x*2

In [102]:
df['Col1'].apply(time2)

0    2
1    4
2    6
3    8
Name: Col1, dtype: int64

In [103]:
del df['Col1']

In [104]:
df

   Col2 Col3
0     4    a
1     5    b
2     6    c
3     4    d

# Read csv

In [105]:
# df = pd.read_csv('example.csv')

In [ ]:

+